#+TITLE: Assignment 1 COMP4300
#+OPTIONS: toc:nil num:2
#+LaTex_header: \input{header.tex}
#+LATEX: \setlength\parindent{0pt}
#+LATEX_COMPILER: xelatex
#+AUTHOR: Abhaas Goyal (u7145384)

#+CAPTION: Table abbreviations
|----------+----------------------|
| *A_T*    | Advection Time       |
| *N_Send* | Blocking Send        |
| *I_Send* | Non-Blocking Send    |
| *G_F*    | Gigaflops per second |
| *P_C*    | Per core (with G_F)  |
| *NP*     | Number of processes  |
| *C_T*    | Calculated time      |
|----------+----------------------|

** Results
- For small values of N (Table 2), got varied results with in some cases blocking being faster and in others non-blocking being faster

#+CAPTION: Blocking vs Non Blocking Send for Small values of N
|-----+------+------+----------+----------+-----------|
| *M* |  *N* | *NP* | *N_Send* | *I_Send* | *Speedup* |
|-----+------+------+----------+----------+-----------|
|  48 | 1000 |    3 |  4.5e-06 |  3.2e-06 |     1.406 |
|  48 | 1000 |    6 |  3.1e-06 |  3.1e-06 |        1. |
|  48 | 1000 |   12 |  1.3e-06 |  9.3e-07 |     1.397 |
|  48 | 1000 |   24 |  1.6e-06 |  8.0e-07 |        2. |
|  48 | 1000 |   48 |  8.3e-07 |  4.7e-07 | 1.7659574 |
|-----+------+------+----------+----------+-----------|
| 192 | 1000 |   48 |  4.5e-07 |  8.9e-07 |     0.505 |
| 192 | 1000 |   96 |  8.6e-07 |  3.3e-07 |     2.606 |
| 192 | 1000 |  192 |  3.7e-07 |  1.7e-07 |     2.176 |
|-----+------+------+----------+----------+-----------|
#+TBLFM: $6=8.3/4.7

- For large values of N (Table 3), one could clearly see that non-blocking sends/received proved to be consistently faster to a noticeable extent. Hence, we would be using that for the following set of questions.

#+CAPTION: Blocking vs Non Blocking Send for Large values of N
|-----+--------+------+----------+----------+-----------|
| *M* |    *N* | *NP* | *N_Send* | *I_Send* | *Speedup* |
|-----+--------+------+----------+----------+-----------|
|  48 | 100000 |    3 |  3.6e-04 |  1.2e-04 |        3. |
|  48 | 100000 |    6 |  1.3e-04 |  7.2e-05 |     1.805 |
|  48 | 100000 |   12 |  8.2e-05 |  8.2e-05 |        1. |
|  48 | 100000 |   24 |  4.2e-05 |  3.4e-05 |     1.235 |
|  48 | 100000 |   48 |  2.0e-05 |  1.2e-05 |     1.666 |
|-----+--------+------+----------+----------+-----------|
| 192 | 100000 |   48 |  2.5e-05 |  2.1e-05 |     1.190 |
| 192 | 100000 |   96 |  1.4e-05 |  8.0e-06 |      1.75 |
| 192 | 100000 |  192 |  5.7e-06 |  3.9e-06 |     1.461 |
|-----+--------+------+----------+----------+-----------|
#+TBLFM: $6=$4/$5
\clearpage

